const Building = require("../data/Building");

const buildings = [
    new Building('btn_mainc', 'ГК', 56.46539, 84.950164, 'ГК: г. Томск, пр-кт. Ленина, д.30'),
    new Building('btn_library', 'НТБ', 56.462526, 84.956883, 'НТБ: г. Томск, ул. Белинского, д.53-А'),
    new Building('btn_incubator', '', 56.463575, 84.95718, 'Бизнес-инкубатор: г. Томск, ул. Белинского, д.51'),
    new Building('btn_culturec', 'МКЦ', 56.462944, 84.960216, 'МКЦ: г. Томск, ул. Усова, д.13-Б'),
    new Building('btn_pool', '', 56.456801, 84.946463, 'Бассейн: г. Томск, ул. Савиных, д.5'),
    new Building('btn_disp', '', 56.463585, 84.959453, 'Профилакторий: г. Томск, ул. Усова, д.13'),
    new Building('btn_gym', '', 56.461362, 84.946526, 'Физкультурно-спортивный центр: г. Томск, ул. Карпова, д.4'),
    new Building('btn_stadium', '', 56.450643, 84.975461, 'Лыжная база Политехник: г. Томск, ул. 19 Гвардейской Дивизии, д.13'),
    new Building('btn_c1', '1', 56.465868, 84.953254, 'Корпус №1: г. Томск, ул. Советская, д.73'),
    new Building('btn_c2', '2', 56.465649, 84.951889, 'Корпус №2: г. Томск, пр-кт. Ленина, д.43-A'),
    new Building('btn_c3', '3', 56.464525, 84.951341, 'Корпус №3: г. Томск, пр-кт. Ленина, д.43'),
    new Building('btn_c4', '4', 56.464525, 84.94993, 'Корпус №4: г. Томск, пр-кт. Ленина, д.30-A'),
    new Building('btn_c6', '6', 56.463839, 84.956425, 'Корпус №6: г. Томск, ул. Усова, д.9-В'),
    new Building('btn_c7', '7', 56.463158, 84.956453, 'Корпус №7: г. Томск, ул. Усова, д.7 стр.6'),
    new Building('btn_c8', '8', 56.463749, 84.954709, 'Корпус №8: г. Томск, ул. Усова, д.7'),
    new Building('btn_c9', '9', 56.461949, 84.947415, 'Корпус №9: г. Томск, ул. Аркадия Иванова, д.4'),
    new Building('btn_c10', '10', 56.456294, 84.950362, 'Корпус №10: г. Томск, пр-кт. Ленина, д.2'),
    new Building('btn_c11', '11', 56.455710, 84.947287, 'Корпус №11: г. Томск, пр-кт. Ленина, д.2 стр.4'),
    new Building('btn_c15', '15', 56.455995, 84.949221, 'Корпус №15: г. Томск, пр-кт. Ленина, д.2 стр.1'),
    new Building('btn_c16', '16', 56.461198, 84.944657, 'Корпус №16: г. Томск, ул. Тимакова, д.12'),
    new Building('btn_c17', '17', 56.456523, 84.948475, 'Корпус №17: г. Томск, пр-кт. Ленина, д.2-А стр.17'),
    new Building('btn_c18', '18', 56.456896, 84.94773, 'Корпус №18: г. Томск, ул. Савиных, д.7'),
    new Building('btn_c19', '19', 56.464863, 84.953236, 'Корпус №19: г. Томск, ул. Советская, д.73 стр.1'),
    new Building('btn_c20', '20', 56.457035, 84.949176, 'Корпус №20: г. Томск, пр-кт. Ленина, д.2 стр.5'),
    new Building('btn_c21', '21', 56.46178, 84.956299, 'Корпус №21: г. Томск, ул. Пирогова, д.10-Б'),
    new Building('btn_cyberc', 'КЦ', 56.462312, 84.954979, 'КЦ: г. Томск, ул. Советская, д.84/3')
]

module.exports = buildings